[
  {
    "name": "rice leaf roller",
    "description": "دودة لف أوراق الأرز (Cnaphalocrocis medinalis) هي عثة تتغذى يرقاتها على أوراق الأرز، حيث تلفها على شكل أنابيب وتكشط النسيج الأخضر، مما يؤدي إلى انخفاض عملية التمثيل الضوئي.",
    "treatment": "استخدام عوامل المكافحة البيولوجية مثل دبابير التريكوجراما أو رش المبيدات الحشرية مثل الكلورانترانيليبرول أو الفلوبندياميد. تشمل الممارسات الزراعية إزالة الأعشاب الضارة والحفاظ على نظافة الحقل المناسبة.",
    "severity": "high"
  },
  {
    "name": "rice leaf caterpillar",
    "description": "يرقات دودة ورق الأرز (Spodoptera mauritia) تتغذى على أوراق الأرز، مما يسبب تساقط الأوراق وانخفاض قوة النبات.",
    "treatment": "رش المبيدات الحشرية مثل السبينوساد أو الإيمامكتين بنزوات. تشجيع المفترسات الطبيعية مثل العناكب والدبابير الطفيلية.",
    "severity": "medium"
  },
  {
    "name": "paddy stem maggot",
    "description": "يرقات ذبابة ساق الأرز (Hydrellia philippina) تحفر في سيقان الأرز، مسببةً القلوب الميتة وتقليل التفريع.",
    "treatment": "تجفيف الحقول بشكل دوري لتعطيل نمو اليرقات. استخدام المبيدات الحشرية مثل الفيبرونيل أو كارتاب هيدروكلوريد.",
    "severity": "medium"
  },
  {
    "name": "asiatic rice borer",
    "description": "يرقات حفار الأرز الآسيوي (Chilo suppressalis) تحفر أنفاقًا في سيقان الأرز، مسببةً القلوب الميتة والرؤوس البيضاء.",
    "treatment": "إطلاق دبابير التريكوجراما للمكافحة البيولوجية. رش المبيدات الحشرية مثل الكلورانترانيليبرول أو الكارتاب.",
    "severity": "high"
  },
  {
    "name": "yellow rice borer",
    "description": "يرقات حفار الأرز الأصفر (Scirpophaga incertulas) تحفر في السيقان، مما يؤدي إلى القلوب الميتة وفقدان المحصول.",
    "treatment": "استخدام أصناف مقاومة. رش المبيدات الحشرية مثل الفيبرونيل أو كارتاب هيدروكلوريد.",
    "severity": "high"
  },
  {
    "name": "rice gall midge",
    "description": "يرقات بعوضة المرارة في الأرز (Orseolia oryzae) تسبب تكوين مرارات (براعم فضية) تمنع تكون السنابل.",
    "treatment": "استخدام أصناف مقاومة. تجفيف الحقول لتعطيل نمو اليرقات. رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد.",
    "severity": "high"
  },
  {
    "name": "Rice Stemfly",
    "description": "يرقات ذبابة ساق الأرز (Chlorops oryzae) تتغذى داخل السيقان، مسببة التقزم والقلوب الميتة.",
    "treatment": "إزالة الأعشاب الضارة والحفاظ على نظافة الحقل المناسبة. رش المبيدات الحشرية مثل الفيبرونيل إذا كانت الإصابة شديدة.",
    "severity": "medium"
  },
  {
    "name": "brown plant hopper",
    "description": "نطاط النبات البني (Nilaparvata lugens) يمتص عصارة نباتات الأرز، مسبباً حروق النطاطات ونقل الأمراض الفيروسية.",
    "treatment": "تجنب التسميد النيتروجيني المفرط. استخدام أصناف مقاومة. رش المبيدات الحشرية مثل الإيميداكلوبريد أو البيميتروزين.",
    "severity": "high"
  },
  {
    "name": "white backed plant hopper",
    "description": "نطاط النبات أبيض الظهر (Sogatella furcifera) يضر الأرز عن طريق امتصاص العصارة والتسبب في حروق النطاطات.",
    "treatment": "الحفاظ على إدارة المياه المناسبة. رش المبيدات الحشرية مثل البوبروفيزين أو الدينوتيفوران.",
    "severity": "high"
  },
  {
    "name": "small brown plant hopper",
    "description": "نطاط النبات البني الصغير (Laodelphax striatellus) يتغذى على الأرز وينقل الأمراض الفيروسية مثل فيروس تخطط الأرز.",
    "treatment": "استخدام أصناف مقاومة. رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد أو الثياميثوكسام.",
    "severity": "medium"
  },
  {
    "name": "rice water weevil",
    "description": "يرقات سوسة ماء الأرز (Lissorhoptrus oryzophilus) تتغذى على جذور الأرز، مسببة تقزم النمو وانخفاض المحصول.",
    "treatment": "تجفيف الحقول بشكل دوري. رش المبيدات الحشرية مثل الكلوثيانيدين أو الفيبرونيل كمعاملة للبذور.",
    "severity": "medium"
  },
  {
    "name": "rice leafhopper",
    "description": "نطاطات أوراق الأرز (Nephotettix spp.) تمتص العصارة وتنقل الأمراض مثل فيروس التونجرو.",
    "treatment": "استخدام أصناف مقاومة. رش المبيدات الحشرية مثل الإيميداكلوبريد أو الثياميثوكسام.",
    "severity": "high"
  },
  {
    "name": "grain spreader thrips",
    "description": "تربس ناشر الحبوب (Haplothrips aculeatus) يتغذى على الحبوب النامية، مسبباً تغير اللون وانخفاض الجودة.",
    "treatment": "رش المبيدات الحشرية مثل السبينوساد أو الأبامكتين خلال مرحلة الإزهار.",
    "severity": "low"
  },
  {
    "name": "rice shell pest",
    "description": "يشير هذا إلى آفات مختلفة تضر بحبوب الأرز في المخازن، بما في ذلك السوس والعث.",
    "treatment": "النظافة المناسبة للتخزين والتبخير بالفوسفين أو استخدام تراب الدياتومي.",
    "severity": "medium"
  },
  {
    "name": "grub",
    "description": "الديدان البيضاء (Holotrichia spp.) هي يرقات تعيش في التربة وتتغذى على الجذور، مسببة ذبول النبات وموته.",
    "treatment": "رش الكلوربيريفوس أو الإيميداكلوبريد على التربة. استخدام مصائد الضوء لصيد الخنافس البالغة.",
    "severity": "medium"
  },
  {
    "name": "mole cricket",
    "description": "صرصور الحقل (Gryllotalpa spp.) يحفر أنفاقاً في التربة ويضر بالجذور والنباتات الصغيرة.",
    "treatment": "رش الكارباريل أو الكلوربيريفوس على التربة. استخدام الطعوم السامة.",
    "severity": "low"
  },
  {
    "name": "wireworm",
    "description": "الديدان السلكية (Agriotes spp.) هي يرقات الخنفساء النطاطة التي تحفر في الجذور والسيقان.",
    "treatment": "تطبيق المبيدات الحشرية على التربة مثل الكلوربيريفوس أو الفيبرونيل قبل الزراعة.",
    "severity": "medium"
  },
  {
    "name": "white margined moth",
    "description": "يرقات العثة بيضاء الحواف (Nodaria niphona) تتغذى على أوراق الأرز، مسببة تساقط الأوراق.",
    "treatment": "رش المبيدات الحشرية مثل الإيمامكتين بنزوات أو السبينوساد عندما تكون اليرقات صغيرة.",
    "severity": "low"
  },
  {
    "name": "black cutworm",
    "description": "يرقات الدودة القارضة السوداء (Agrotis ipsilon) تقطع النباتات الصغيرة عند القاعدة وتتغذى على الأوراق.",
    "treatment": "استخدام الطعوم السامة أو رش المبيدات الحشرية مثل الكلوربيريفوس أو السايبرمثرين.",
    "severity": "medium"
  },
  {
    "name": "large cutworm",
    "description": "الدودة القارضة الكبيرة (Agrotis tokionis) تتصرف بشكل مشابه للدودة القارضة السوداء، حيث تقطع الشتلات.",
    "treatment": "نفس علاج الدودة القارضة السوداء - الطعوم السامة ومبيدات التربة الحشرية.",
    "severity": "medium"
  },
  {
    "name": "yellow cutworm",
    "description": "يرقات الدودة القارضة الصفراء (Agrotis segetum) تتغذى على سيقان النباتات وجذورها.",
    "treatment": "رش المبيدات الحشرية مثل لامدا-سيهالوثرين أو الدلتامثرين.",
    "severity": "medium"
  },
  {
    "name": "red spider",
    "description": "عناكب العنكبوت الأحمر (Tetranychus spp.) تمتص عصارة النبات، مسببة الاصفرار وتساقط الأوراق.",
    "treatment": "رش مبيدات العناكب مثل الأبامكتين أو الهيكسيثيازوكس. زيادة الرطوبة لتثبيط العناكب.",
    "severity": "medium"
  },
  {
    "name": "corn borer",
    "description": "يرقات حفار الذرة (Ostrinia furnacalis) تحفر أنفاقًا في السيقان، مسببة تكسر النبات.",
    "treatment": "استخدام أصناف الذرة Bt. رش المبيدات الحشرية مثل الكلورانترانيليبرول أثناء فقس البيض.",
    "severity": "high"
  },
  {
    "name": "army worm",
    "description": "ديدان الجيش (Spodoptera spp.) تتغذى بشراهة على الأوراق، مسببة تساقط الأوراق بسرعة.",
    "treatment": "رش المبيدات الحشرية مثل السبينوساد أو الإيمامكتين بنزوات عندما تكون اليرقات صغيرة.",
    "severity": "high"
  },
  {
    "name": "aphids",
    "description": "المن (أنواع مختلفة) يمتص عصارة النبات وينقل الأمراض الفيروسية.",
    "treatment": "استخدام الصابون المبيد للحشرات أو النيونيكوتينويدات مثل الإيميداكلوبريد. تشجيع الأعداء الطبيعيين.",
    "severity": "medium"
  },
  {
    "name": "Potosiabre vitarsis",
    "description": "خنفساء تتغذى على الأوراق وتضر بمحاصيل مختلفة عن طريق تخريم الأوراق.",
    "treatment": "رش المبيدات الحشرية بالملامسة مثل السايبرمثرين أو الدلتامثرين.",
    "severity": "low"
  },
  {
    "name": "peach borer",
    "description": "يرقات حفار الخوخ (Synanthedon exitiosa) تحفر أنفاقاً تحت اللحاء، مما يضر بالأنسجة الوعائية.",
    "treatment": "رش جذوع الأشجار بالكلوربيريفوس أو البيرميثرين خلال فترة طيران الحشرات البالغة.",
    "severity": "high"
  },
  {
    "name": "english grain aphid",
    "description": "من الحبوب الإنجليزي (Sitobion avenae) يتغذى على الحبوب، مما يقلل المحصول والجودة.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد أو الثياميثوكسام.",
    "severity": "medium"
  },
  {
    "name": "green bug",
    "description": "الحشرة الخضراء (Schizaphis graminum) هي نوع من المن يضر بالحبوب الصغيرة عن طريق امتصاص العصارة.",
    "treatment": "استخدام أصناف مقاومة. رش المبيدات الحشرية مثل الديميثوات أو الملاثيون.",
    "severity": "medium"
  },
  {
    "name": "bird cherry-oat aphid",
    "description": "من الكرز الطيور والشوفان (Rhopalosiphum padi) ينقل فيروس التقزم الأصفر للشعير.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد في وقت مبكر من الموسم.",
    "severity": "high"
  },
  {
    "name": "wheat blossom midge",
    "description": "يرقات بعوضة زهر القمح (Sitodiplosis mosellana) تتغذى على حبات القمح النامية.",
    "treatment": "رش المبيدات الحشرية مثل لامدا-سيهالوثرين في مرحلة السنبلة. استخدام أصناف مقاومة.",
    "severity": "high"
  },
  {
    "name": "penthaleus major",
    "description": "عثة تتغذى على حبوب الشتاء، مسببة تلون الأوراق باللون الفضي.",
    "treatment": "رش مبيدات العناكب مثل البروبارجيت أو الأبامكتين في أوائل الربيع.",
    "severity": "medium"
  },
  {
    "name": "longlegged spider mite",
    "description": "عنكبوت العنكبوت طويل الأرجل (Tetranychus ludeni) يسبب تنقر الأوراق وتكوين شبكات.",
    "treatment": "رش مبيدات العناكب مثل الهيكسيثيازوكس أو الأبامكتين. زيادة الرطوبة.",
    "severity": "medium"
  },
  {
    "name": "wheat phloeothrips",
    "description": "تربس القمح (Haplothrips tritici) يتغذى على الأوراق والسنابل، مما يقلل المحصول.",
    "treatment": "رش المبيدات الحشرية مثل السبينوساد أو الأبامكتين خلال مرحلة السنبلة.",
    "severity": "low"
  },
  {
    "name": "wheat sawfly",
    "description": "يرقات دبور القمح المنشاري (Cephus pygmeus) تحفر في السيقان، مسببة الرقاد.",
    "treatment": "استخدام أصناف مقاومة. رش المبيدات الحشرية مثل السايبرمثرين خلال فترة طيران الحشرات البالغة.",
    "severity": "medium"
  },
  {
    "name": "cerodonta denticornis",
    "description": "ذبابة قد تضر يرقاتها بجذور محاصيل مختلفة.",
    "treatment": "رش مبيدات التربة الحشرية مثل الكلوربيريفوس إذا كانت الإصابة شديدة.",
    "severity": "low"
  },
  {
    "name": "beet fly",
    "description": "يرقات ذبابة البنجر (Pegomya hyoscyami) تحفر في أوراق البنجر، مما يقلل من التمثيل الضوئي.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الديميثوات عند أول علامة للضرر.",
    "severity": "medium"
  },
  {
    "name": "flea beetle",
    "description": "خنافس البراغيث (أنواع مختلفة) تقضم ثقوباً صغيرة في أوراق النباتات الصغيرة.",
    "treatment": "رش المبيدات الحشرية مثل الكارباريل أو البيرميثرين. استخدام أغطية الصفوف العائمة.",
    "severity": "medium"
  },
  {
    "name": "cabbage army worm",
    "description": "يرقات دودة جيش الملفوف (Mamestra brassicae) تتغذى على المحاصيل الصليبية.",
    "treatment": "رش Bt أو المبيدات الحشرية مثل السبينوساد عندما تكون اليرقات صغيرة.",
    "severity": "high"
  },
  {
    "name": "beet army worm",
    "description": "دودة جيش البنجر (Spodoptera exigua) هي آفة متعددة العوائل تتسبب في تساقط أوراق المحاصيل.",
    "treatment": "رش المبيدات الحشرية مثل الإيمامكتين بنزوات أو الكلورانترانيليبرول.",
    "severity": "high"
  },
  {
    "name": "Beet spot flies",
    "description": "ذباب صغير تحفر يرقاته الأوراق، مما يخلق بقعًا مميزة.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الديميثوات عند أول علامة للضرر.",
    "severity": "low"
  },
  {
    "name": "meadow moth",
    "description": "يرقات عثة المروج (Loxostege sticticalis) تتغذى على محاصيل مختلفة، مسببة تساقط الأوراق.",
    "treatment": "رش المبيدات الحشرية مثل لامدا-سيهالوثرين عندما تكون اليرقات صغيرة.",
    "severity": "medium"
  },
  {
    "name": "beet weevil",
    "description": "سوسة البنجر (Bothynoderes punctiventris) تضر البالغات واليرقات بجذور البنجر.",
    "treatment": "رش مبيدات التربة الحشرية مثل الكلوربيريفوس عند الزراعة. تطبيق الدورة الزراعية.",
    "severity": "high"
  },
  {
    "name": "sericaorient alismots chulsky",
    "description": "خنفساء جعلية تتغذى يرقاتها على جذور نباتات مختلفة.",
    "treatment": "رش مبيدات التربة الحشرية مثل الإيميداكلوبريد أو الكلوربيريفوس.",
    "severity": "medium"
  },
  {
    "name": "alfalfa weevil",
    "description": "يرقات سوسة البرسيم (Hypera postica) تخرم الأوراق، مما يقلل المحصول.",
    "treatment": "رش المبيدات الحشرية مثل لامدا-سيهالوثرين أو الملاثيون في أوائل الربيع.",
    "severity": "high"
  },
  {
    "name": "flax budworm",
    "description": "يرقات دودة براعم الكتان (Heliothis ononis) تتغذى على براعم وأزهار الكتان.",
    "treatment": "رش المبيدات الحشرية مثل الإندوكساكارب أو الإيمامكتين بنزوات في مرحلة البرعم.",
    "severity": "medium"
  },
  {
    "name": "alfalfa plant bug",
    "description": "بق نبات البرسيم (Adelphocoris lineolatus) يمتص عصارة البرسيم، مما يقلل المحصول.",
    "treatment": "رش المبيدات الحشرية مثل البيفنثرين أو الإيميداكلوبريد عند ظهور البق.",
    "severity": "medium"
  },
  {
    "name": "tarnished plant bug",
    "description": "البق الباهت (Lygus lineolaris) يتغذى على محاصيل مختلفة، مسبباً تشوهات.",
    "treatment": "رش المبيدات الحشرية مثل الأسيفيت أو الثياميثوكسام عند ظهور الضرر.",
    "severity": "high"
  },
  {
    "name": "Locustoidea",
    "description": "الجراد والنطاطات التي يمكن أن تسبب تساقطًا شديدًا لأوراق المحاصيل.",
    "treatment": "رش تركيبات الطعم من المبيدات الحشرية مثل الكارباريل أو استخدام المكافحة البيولوجية.",
    "severity": "high"
  },
  {
    "name": "lytta polita",
    "description": "خنفساء نفاطة تتغذى على أوراق محاصيل مختلفة.",
    "treatment": "رش المبيدات الحشرية بالملامسة مثل السايبرمثرين عند ظهور الخنافس.",
    "severity": "low"
  },
  {
    "name": "legume blister beetle",
    "description": "الخنافس النفاطة (Epicauta spp.) تتغذى على البقوليات ويمكن أن تكون سامة للماشية.",
    "treatment": "رش المبيدات الحشرية مثل الكارباريل أو البيرميثرين عندما تكون الخنافس كثيرة.",
    "severity": "medium"
  },
  {
    "name": "blister beetle",
    "description": "أنواع مختلفة تتغذى على المحاصيل وتحتوي على الكانثاريدين، السام للحيوانات.",
    "treatment": "المكافحة بالمبيدات الحشرية عندما تكون الأعداد كبيرة. الإزالة باليد إذا أمكن.",
    "severity": "medium"
  },
  {
    "name": "therioaphis maculata Buckton",
    "description": "من البرسيم المرقط الذي يسبب اصفرار وتقزم البرسيم.",
    "treatment": "استخدام أصناف مقاومة. رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد.",
    "severity": "high"
  },
  {
    "name": "odontothrips loti",
    "description": "نوع من التربس يضر بالبقوليات عن طريق التغذية على الأوراق والأزهار.",
    "treatment": "رش المبيدات الحشرية مثل السبينوساد أو الأبامكتين عند اكتشاف التربس.",
    "severity": "medium"
  },
  {
    "name": "Thrips",
    "description": "حشرات صغيرة تكشط نسيج النبات وتمتص العصارة، مسببة تلونًا فضيًا وتشوهات.",
    "treatment": "رش المبيدات الحشرية مثل السبينوساد أو الأبامكتين. استخدام الأغطية العاكسة.",
    "severity": "medium"
  },
  {
    "name": "alfalfa seed chalcid",
    "description": "يرقات كالسيد بذور البرسيم (Bruchophagus roddi) تتطور داخل بذور البرسيم.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد خلال فترة الإزهار.",
    "severity": "high"
  },
  {
    "name": "Pieris canidia",
    "description": "فراشة الكرنب البيضاء الهندية التي تتغذى يرقاتها على النباتات الصليبية.",
    "treatment": "رش Bt أو المبيدات الحشرية مثل السبينوساد عندما تكون اليرقات صغيرة.",
    "severity": "medium"
  },
  {
    "name": "Apolygus lucorum",
    "description": "البق الأخضر الميريدي الذي يضر بمحاصيل مختلفة عن طريق امتصاص العصارة.",
    "treatment": "رش المبيدات الحشرية مثل الإيميداكلوبريد أو الثياميثوكسام عند ظهور البق.",
    "severity": "medium"
  },
  {
    "name": "Limacodidae",
    "description": "اليرقات البزاقية التي تتغذى على أوراق الأشجار والمحاصيل المختلفة.",
    "treatment": "رش المبيدات الحشرية مثل السبينوساد أو Bacillus thuringiensis عند ظهور اليرقات.",
    "severity": "low"
  },
  {
    "name": "Viteus vitifoliae",
    "description": "حشرة الفيلوكسيرا العنب، وهي آفة تصيب كروم العنب وتضر بالجذور والأوراق.",
    "treatment": "استخدام أصول جذرية مقاومة. رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد.",
    "severity": "high"
  },
  {
    "name": "Colomerus vitis",
    "description": "عثة الإرينوم للعنب التي تسبب مرارات على أوراق العنب.",
    "treatment": "رش مبيدات العناكب مثل الأبامكتين أو الهيكسيثيازوكس عند اكتشاف العث.",
    "severity": "low"
  },
  {
    "name": "Brevipoalpus lewisi McGregor",
    "description": "العثة المسطحة للحمضيات التي تتغذى على أوراق وثمار الحمضيات.",
    "treatment": "رش مبيدات العناكب مثل الأبامكتين أو البيريدابين عند اكتشاف العث.",
    "severity": "medium"
  },
  {
    "name": "oides decempunctata",
    "description": "خنفساء برغوث العنب التي تتغذى على براعم العنب في الربيع.",
    "treatment": "رش المبيدات الحشرية مثل الكارباريل أو البيرميثرين عند انتفاخ البراعم.",
    "severity": "medium"
  },
  {
    "name": "Polyphagotars onemus latus",
    "description": "العثة العريضة التي تضر بمحاصيل مختلفة، مسببة تشوه الأوراق.",
    "treatment": "رش مبيدات العناكب مثل الأبامكتين أو الهيكسيثيازوكس. الحفاظ على رطوبة عالية.",
    "severity": "medium"
  },
  {
    "name": "Pseudococcus comstocki Kuwana",
    "description": "البق الدقيقي الكومستوكي الذي يتغذى على أشجار الفاكهة ونباتات الزينة المختلفة.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد. استخدام المكافحة البيولوجية.",
    "severity": "high"
  },
  {
    "name": "parathrene regalis",
    "description": "عثة شفافة الأجنحة تحفر يرقاتها في سيقان نباتات مختلفة.",
    "treatment": "رش جذوع الأشجار بالكلوربيريفوس خلال فترة طيران الحشرات البالغة.",
    "severity": "medium"
  },
  {
    "name": "Ampelophaga",
    "description": "دودة قرن العنب، وهي يرقة كبيرة تتغذى على أوراق العنب.",
    "treatment": "التقاط اليرقات يدويًا أو رش Bt أو السبينوساد عندما تكون اليرقات صغيرة.",
    "severity": "medium"
  },
  {
    "name": "Lycorma delicatula",
    "description": "ذبابة الفانوس المرقطة، وهي آفة غازية تتغذى على العديد من النباتات الخشبية.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الدينوتيفوران. إزالة كتل البيض.",
    "severity": "high"
  },
  {
    "name": "Xylotrechus",
    "description": "خنافس حفر الخشب التي تضر بمختلف الأشجار والنباتات الخشبية.",
    "treatment": "رش جذوع الأشجار بالبيرميثرين أو البيفنثرين لمنع الإصابة.",
    "severity": "medium"
  },
  {
    "name": "Cicadella viridis",
    "description": "نطاط الأوراق الأخضر الذي يتغذى على نباتات مختلفة وينقل الأمراض.",
    "treatment": "رش المبيدات الحشرية مثل الإيميداكلوبريد أو الثياميثوكسام عند ظهور النطاطات.",
    "severity": "medium"
  },
  {
    "name": "Miridae",
    "description": "بق النباتات الذي يتغذى على محاصيل مختلفة، مسبباً تشوهات وتقزم.",
    "treatment": "رش المبيدات الحشرية مثل الأسيفيت أو الإيميداكلوبريد عندما يكون البق كثيرًا.",
    "severity": "medium"
  },
  {
    "name": "Trialeurodes vaporariorum",
    "description": "الذبابة البيضاء للبيوت المحمية التي تتغذى على العديد من المحاصيل وتنقل الفيروسات.",
    "treatment": "استخدام المصائد اللاصقة الصفراء. رش المبيدات الحشرية مثل البيريبروكسيفين أو الإيميداكلوبريد.",
    "severity": "high"
  },
  {
    "name": "Erythroneura apicalis",
    "description": "نطاط أوراق يتغذى على أوراق العنب، مسبباً تنقرًا وانخفاض الحيوية.",
    "treatment": "رش المبيدات الحشرية مثل الإيميداكلوبريد أو الثياميثوكسام عند ظهور النطاطات.",
    "severity": "medium"
  },
  {
    "name": "Papilio xuthus",
    "description": "فراشة الذيل المشقوق الآسيوية التي تتغذى يرقاتها على أوراق الحمضيات.",
    "treatment": "رش Bt أو السبينوساد عندما تكون اليرقات صغيرة. الالتقاط باليد إذا كانت الإصابة خفيفة.",
    "severity": "low"
  },
  {
    "name": "Panonchus citri McGregor",
    "description": "عثة الحمضيات الحمراء التي تسبب تنقر الأوراق وانخفاض جودة الثمار.",
    "treatment": "رش مبيدات العناكب مثل الأبامكتين أو الهيكسيثيازوكس عند اكتشاف العث.",
    "severity": "medium"
  },
  {
    "name": "Phyllocoptes oleiverus ashmead",
    "description": "عثة براعم الزيتون التي تسبب تشوه براعم وأوراق الزيتون.",
    "treatment": "رش الكبريت أو مبيدات العناكب المتخصصة عند اكتشاف العث.",
    "severity": "medium"
  },
  {
    "name": "Icerya purchasi Maskell",
    "description": "الحشرة القشرية القطنية، وهي آفة تصيب الحمضيات ونباتات أخرى.",
    "treatment": "استخدام المكافحة البيولوجية بخنافس الفيداليا. رش الزيوت البستانية.",
    "severity": "high"
  },
  {
    "name": "Unaspis yanonensis",
    "description": "الحشرة القشرية رأس السهم التي تصيب الحمضيات، مسببة اصفرار الأوراق وتساقطها.",
    "treatment": "رش الزيوت البستانية أو المبيدات الحشرية الجهازية مثل الإيميداكلوبريد.",
    "severity": "medium"
  },
  {
    "name": "Ceroplastes rubens",
    "description": "الحشرة القشرية الشمعية الحمراء التي تتغذى على نباتات خشبية مختلفة.",
    "treatment": "رش الزيوت البستانية أو المبيدات الحشرية الجهازية خلال مرحلة اليرقات الزاحفة.",
    "severity": "medium"
  },
  {
    "name": "Chrysomphalus aonidum",
    "description": "الحشرة القشرية الحمراء لفلوريدا، وهي آفة تصيب الحمضيات وأشجار الفاكهة الأخرى.",
    "treatment": "رش الزيوت البستانية أو المبيدات الحشرية الجهازية خلال مرحلة اليرقات الزاحفة.",
    "severity": "high"
  },
  {
    "name": "Parlatoria zizyphus Lucus",
    "description": "الحشرة القشرية لنخيل التمر التي تصيب نخيل التمر والحمضيات.",
    "treatment": "رش الزيوت البستانية أو المبيدات الحشرية الجهازية خلال مرحلة اليرقات الزاحفة.",
    "severity": "medium"
  },
  {
    "name": "Nipaecoccus vastalor",
    "description": "البق الدقيقي الكروي الذي يتغذى على نباتات استوائية مختلفة.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد. استخدام المكافحة البيولوجية.",
    "severity": "medium"
  },
  {
    "name": "Aleurocanthus spiniferus",
    "description": "الذبابة البيضاء الشوكية للحمضيات التي تتغذى على الحمضيات ونباتات أخرى.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد. استخدام المصائد اللاصقة الصفراء.",
    "severity": "high"
  },
  {
    "name": "Tetradacus c Bactrocera minax",
    "description": "ذبابة الحمضيات الصينية التي تصيب يرقاتها ثمار الحمضيات.",
    "treatment": "استخدام بخاخات الطعم البروتيني. رش المبيدات الحشرية الجهازية مثل الفيبرونيل.",
    "severity": "high"
  },
  {
    "name": "Dacus dorsalis(Hendel)",
    "description": "ذبابة الفاكهة الشرقية التي تصيب العديد من الفواكه الاستوائية.",
    "treatment": "استخدام بخاخات الطعم البروتيني مع الملاثيون. تنفيذ تدابير الحجر الصحي.",
    "severity": "high"
  },
  {
    "name": "Bactrocera tsuneonis",
    "description": "نوع من ذبابة الفاكهة يصيب الحمضيات والفواكه الأخرى.",
    "treatment": "نفس علاج ذباب الفاكهة الآخر - بخاخات الطعم وتدابير الحجر الصحي.",
    "severity": "high"
  },
  {
    "name": "Prodenia litura",
    "description": "دودة ورق القطن، وهي آفة متعددة العوائل تضر بالعديد من المحاصيل.",
    "treatment": "رش المبيدات الحشرية مثل الكلورانترانيليبرول أو الإيمامكتين بنزوات.",
    "severity": "high"
  },
  {
    "name": "Adristyrannus",
    "description": "بق ذو أرجل ورقية يتغذى على فواكه ومحاصيل مختلفة.",
    "treatment": "رش المبيدات الحشرية بالملامسة مثل السايبرمثرين عند ظهور البق.",
    "severity": "medium"
  },
  {
    "name": "Phyllocnistis citrella Stainton",
    "description": "صانعة أنفاق أوراق الحمضيات التي تحفر يرقاتها أنفاقاً متعرجة في أوراق الحمضيات.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الأبامكتين أو السبينوساد. استخدام مصائد الفرمون.",
    "severity": "medium"
  },
  {
    "name": "Toxoptera citricidus",
    "description": "من الحمضيات البني الذي ينقل فيروس تريستيزا الحمضيات.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد أو الثياميثوكسام.",
    "severity": "high"
  },
  {
    "name": "Toxoptera aurantii",
    "description": "من الحمضيات الأسود الذي يتغذى على الحمضيات ونباتات أخرى.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد عند ظهور المن.",
    "severity": "medium"
  },
  {
    "name": "Aphis citricola Vander Goot",
    "description": "من السبيريا الذي يتغذى على الحمضيات ونباتات الزينة.",
    "treatment": "رش الصابون المبيد للحشرات أو المبيدات الحشرية الجهازية عند ظهور المن.",
    "severity": "low"
  },
  {
    "name": "Scirtothrips dorsalis Hood",
    "description": "تربس الفلفل الحار الذي يضر بالعديد من المحاصيل عن طريق التغذية على الأنسجة الصغيرة.",
    "treatment": "رش المبيدات الحشرية مثل السبينوساد أو الأبامكتين عند اكتشاف التربس.",
    "severity": "high"
  },
  {
    "name": "Dasineura sp",
    "description": "بعوض المرارة الذي يسبب تشوهات في محاصيل مختلفة.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد خلال فترة طيران الحشرات البالغة.",
    "severity": "medium"
  },
  {
    "name": "Lawana imitata Melichar",
    "description": "نطاط أوراق المانجو الذي يتغذى على المانجو وأشجار الفاكهة الأخرى.",
    "treatment": "رش المبيدات الحشرية مثل الإيميداكلوبريد أو الثياميثوكسام عند ظهور النطاطات.",
    "severity": "medium"
  },
  {
    "name": "Salurnis marginella Guerr",
    "description": "نطاط نباتات يتغذى على نباتات استوائية مختلفة.",
    "treatment": "رش المبيدات الحشرية بالملامسة مثل السايبرمثرين عندما تكون النطاطات كثيرة.",
    "severity": "low"
  },
  {
    "name": "Deporaus marginatus Pascoe",
    "description": "سوسة قطع أوراق المانجو التي تضر بأوراق المانجو.",
    "treatment": "رش المبيدات الحشرية بالملامسة مثل السايبرمثرين عند ظهور السوس.",
    "severity": "medium"
  },
  {
    "name": "Chlumetia transversa",
    "description": "حفار براعم المانجو الذي تحفر يرقاته في براعم المانجو.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد أثناء النمو الجديد.",
    "severity": "high"
  },
  {
    "name": "Mango flat beak leafhopper",
    "description": "نطاط أوراق يتغذى على المانجو، مسبباً ضرراً للأوراق وعفنًا سخاميًا.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد عند ظهور النطاطات.",
    "severity": "medium"
  },
  {
    "name": "Rhytidodera bowrinii white",
    "description": "خنفساء ذات قرون طويلة تحفر يرقاتها في المانجو والأشجار الأخرى.",
    "treatment": "رش جذوع الأشجار بالكلوربيريفوس أو البيرميثرين لمنع الإصابة.",
    "severity": "medium"
  },
  {
    "name": "Sternochetus frigidus",
    "description": "سوسة بذور المانجو التي تتطور يرقاتها داخل بذور المانجو.",
    "treatment": "رش المبيدات الحشرية الجهازية مثل الإيميداكلوبريد خلال نمو الثمار.",
    "severity": "high"
  },
  {
    "name": "Cicadellidae",
    "description": "نطاطات الأوراق التي تتغذى على نباتات مختلفة وتنقل الأمراض.",
    "treatment": "رش المبيدات الحشرية مثل الإيميداكلوبريد أو الثياميثوكسام عند ظهور النطاطات.",
    "severity": "medium"
  }
]